app/services/tax_rules/validation_alerts.rb

      scope = tax_module.tax_parameters.open_for_validation.includes(:operation).order(:code)
---
SELECT "operations".* FROM "operations" WHERE "operations"."id" IN (3, 6, 4, 5, 7)