app/controllers/dashboard_controller.rb

  def index
    @tax_module = TaxModule.includes(:product_area, :sector, :operations, :tax_parameters, :assumptions, :credit_categories, :tax_rule_versions)
      .find_by(code: "real_estate_tax_reform")

    @operations = @tax_module ? @tax_module.operations.ordered : Operation.none
    @parameters = @tax_module ? @tax_module.tax_parameters.includes(:operation).order(:code) : TaxParameter.none
    @credit_categories = @tax_module ? @tax_module.credit_categories.order(:name) : CreditCategory.none
---
SELECT "operations".* FROM "operations" WHERE "operations"."id" IN (3, 2, 6, 1)
SELECT "tax_parameters".* FROM "tax_parameters" WHERE "tax_parameters"."tax_module_id" = 1 ORDER BY "tax_parameters"."code" ASC
SELECT "tax_modules".* FROM "tax_modules" WHERE "tax_modules"."code" = 'real_estate_tax_reform' LIMIT 1
SELECT "assumptions".* FROM "assumptions" WHERE "assumptions"."tax_module_id" = 1
SELECT "credit_categories".* FROM "credit_categories" WHERE "credit_categories"."tax_module_id" = 1
SELECT "operations".* FROM "operations" WHERE "operations"."tax_module_id" = 1
SELECT "tax_parameters".* FROM "tax_parameters" WHERE "tax_parameters"."tax_module_id" = 1
SELECT "credit_categories".* FROM "credit_categories" WHERE "credit_categories"."tax_module_id" = 1 ORDER BY "credit_categories"."name" ASC