app/controllers/simulations_controller.rb

SELECT "simulation_results".* FROM "simulation_results" WHERE "simulation_results"."simulation_id" = $1  [["simulation_id", 379637274]]
SELECT "simulations".* FROM "simulations" WHERE "simulations"."id" = $1 LIMIT $2  [["id", 379637274], ["LIMIT", 1]]
SELECT "tax_modules".* FROM "tax_modules" WHERE "tax_modules"."id" = $1  [["id", 396966388]]
SELECT "operations".* FROM "operations" WHERE "operations"."tax_module_id" = 1
---
  def show
    @simulation = Simulation.includes(:case_file, :tax_module, :operation, :tax_rule_version, :simulation_result).find(params[:id])

SELECT "operations".* FROM "operations" WHERE "operations"."tax_module_id" = $1 AND "operations"."code" = $2 LIMIT $3  [["tax_module_id", 396966388], ["code", "lease_property"], ["LIMIT", 1]]
SELECT "tax_modules".* FROM "tax_modules" WHERE "tax_modules"."code" = 'real_estate_tax_reform' LIMIT 1
SELECT "operations".* FROM "operations" WHERE "operations"."tax_module_id" = $1  [["tax_module_id", 396966388]]
SELECT "tax_rule_versions".* FROM "tax_rule_versions" WHERE "tax_rule_versions"."tax_module_id" = $1  [["tax_module_id", 396966388]]
---
  def load_form_context
    @tax_module = TaxModule.includes(:operations, :tax_rule_versions).find_by!(code: "real_estate_tax_reform")
    @operations = @tax_module.operations.where(code: OPERATION_CODES).ordered
    @tax_rule_version = @tax_module.tax_rule_versions.ordered.first